<?xml version="1.0"?>
<CastXML format="1.1.6">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10"/>
  <Typedef id="_2" name="__int128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_15" context="_1" location="f0:0" file="f0" line="0"/>
  <Variable id="_7" name="global_int1" type="_16v" init="23130U" context="_1" location="f1:1" file="f1" line="1" mangled="_Z11global_int1"/>
  <Variable id="_8" name="global_sink_int1" type="_16v" init="65535U" context="_1" location="f1:2" file="f1" line="2" mangled="_Z16global_sink_int1"/>
  <Variable id="_9" name="global_byte1" type="_17v" init="250U" context="_1" location="f1:3" file="f1" line="3" mangled="_Z12global_byte1"/>
  <Function id="_10" name="main" returns="_18" context="_1" location="f1:6" file="f1" line="6" mangled="_Z4main"/>
  <FundamentalType id="_11" name="__int128" size="128" align="128"/>
  <FundamentalType id="_12" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_13" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_19 _20 _21 _22" size="256" align="64"/>
  <PointerType id="_14" type="_23" size="64" align="64"/>
  <ArrayType id="_15" min="0" max="0" type="_24"/>
  <FundamentalType id="_16" name="unsigned int" size="32" align="32"/>
  <CvQualifiedType id="_16v" type="_16" volatile="1"/>
  <FundamentalType id="_17" name="unsigned char" size="8" align="8"/>
  <CvQualifiedType id="_17v" type="_17" volatile="1"/>
  <FundamentalType id="_18" name="int" size="32" align="32"/>
  <Field id="_19" name="isa" type="_25" context="_13" access="public" offset="0"/>
  <Field id="_20" name="flags" type="_18" context="_13" access="public" offset="64"/>
  <Field id="_21" name="str" type="_26" context="_13" access="public" offset="128"/>
  <Field id="_22" name="length" type="_27" context="_13" access="public" offset="192"/>
  <Struct id="_24" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_28 _29 _30 _31" size="192" align="64"/>
  <PointerType id="_25" type="_18c" size="64" align="64"/>
  <CvQualifiedType id="_18c" type="_18" const="1"/>
  <PointerType id="_26" type="_23c" size="64" align="64"/>
  <CvQualifiedType id="_23c" type="_23" const="1"/>
  <FundamentalType id="_27" name="long int" size="64" align="64"/>
  <Field id="_28" name="gp_offset" type="_16" context="_24" access="public" offset="0"/>
  <Field id="_29" name="fp_offset" type="_16" context="_24" access="public" offset="32"/>
  <Field id="_30" name="overflow_arg_area" type="_32" context="_24" access="public" offset="64"/>
  <Field id="_31" name="reg_save_area" type="_32" context="_24" access="public" offset="128"/>
  <PointerType id="_32" type="_33" size="64" align="64"/>
  <FundamentalType id="_23" name="char" size="8" align="8"/>
  <FundamentalType id="_33" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="helloWorld.c"/>
</CastXML>
